n,m=input().split('/')
n,m=int(n),int(m)
if n==1:
    print('这是2018年的第%d天'%m)
if n==2:
    a=m+31
    print('这是2018年的第%d天'%a)
if n==3:
    a=m+31+28
    print('这是2018年的第%d天'%a)
if n==4:
    a=m+31*2+28
    print('这是2018年的第%d天'%a)
if n==5:
    a=m+31*2+28+30
    print('这是2018年的第%d天'%a)
if n==6:
    a=m+31*3+28+30
    print('这是2018年的第%d天'%a)
if n==7:
    a=m+31*3+28+30*2
    print('这是2018年的第%d天'%a)
if n==8:
    a=m+31*4+28+30*2
    print('这是2018年的第%d天'%a)
if n==9:
    a=m+31*5+28+30*2
    print('这是2018年的第%d天'%a)
if n==10:
    a=m+31*5+28+30*3
    print('这是2018年的第%d天'%a)
if n==11:
    a=m+31*6+28+30*3
    print('这是2018年的第%d天'%a)
if n==12:
    a=m+31*6+28+30*4
    print('这是2018年的第%d天'%a)
